read_verilog phytx.v
hierarchy -check -top phytx
proc; opt; fsm; opt; memory; opt
techmap; opt 
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
clean
write_verilog phytxSynth.v